### 1. pandas 패키지 로드

In [3]:
import pandas as pd

### 2. Series

In [4]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
arr = [5, 6, 7, 8]
pd.Series(arr)

0    5
1    6
2    7
3    8
dtype: int64

### 3. Dataframe

In [9]:
company = [['a','b','c'],[1, 2, 3]]
df1 = pd.DataFrame(company)
df1

   0  1  2
0  a  b  c
1  1  2  3

In [11]:
df1.columns = ['one', 'two', 'three']
df1

  one two three
0   a   b     c
1   1   2     3

In [12]:
company2 = {'기업명' : ['삼성', '현대', '네이버'], '매출액' : [200, 150, 100]}
df2 = pd.DataFrame(company2)
df2

   기업명  매출액
0   삼성  200
1   현대  150
2  네이버  100

In [14]:
df2.index = df2['기업명']
df2

     기업명  매출액
기업명
삼성    삼성  200
현대    현대  150
네이버  네이버  100

### 4. Series = column

In [15]:
df2['기업명']

기업명
삼성      삼성
현대      현대
네이버    네이버
Name: 기업명, dtype: object

In [16]:
type(df2['기업명'])

pandas.core.series.Series